#"Калькулятор"
x=int(input())
kilk=0
kilk_parni=0 #обчислення скільки парних чисел в 
s=0
dobutok=1 #добуток всіх чисел, и перемножаємо всі цифри одна на одну, якщо поставити замість 1, 0, тоді вони просто перемножуться на 0
maximum=0#знаходимо найбільше число, і в змінну вписуємо найменше число
minimum=9 #знайдемо мінімальне число, і в писуємо найбільше число
while x>0:
    last=x%10#присвоїмо це в змінну
    kilk=kilk+1
    if last%2==0:#якщо число ділиться без залишку на два, то воно парне, і к-ксть парних чисел в виводі зміниться на 1
        kilk_parni+=1
    s=s+last
    dobutok=dobutok*last#змінній dobutok ми присвоєюмо значення, множення на наший новий залишок (19, 1*9)
    if last>maximum:#якщо число яке проходить через цикл є більше ніж 0, (для першої цифри), та більше ніж попередня (для другої і всіх настпупних)
        maximum=last#то воно буде записане сюда як максимальне, і не зміниться якшо не знайдеться більшої цифри в числі 
    if last<minimum: #все працює по ті же самій схемі що і з максимальним, якщо перше число менше 9, то воно записується як мінімальне
        minimum=last#і так до ти пір, поки не дойде до кінця цикл
    x=x//10

print("Сума чисел:", s)
print("Всього чисел:", kilk)
print("Всього парних чисел:", kilk_parni)
print("Добуток всіх чисел:", dobutok)
print("Найбільше число:", maximum)
print("Найменше число:", minimum)